mamedev/mame/src/devices/cpu/tms32082/mp_ops.cpp
// license:BSD-3-Clause
// copyright-holders:Ville Linde
// TMS320C82 Master Processor core execution

#include "emu.h"
#include "tms32082.h"


#define OP_LINK() ((m_ir >> 27) & 0x1f)
#define OP_RD() ((m_ir >> 27) & 0x1f)
#define OP_RS() ((m_ir >> 22) & 0x1f)
#define OP_BASE() ((m_ir >> 22) & 0x1f)
#define OP_SIMM15() ((m_ir & 0x4000) ? (0xffffe000 | (m_ir & 0x7fff)) : (m_ir & 0x7fff))
#define OP_UIMM15() (m_ir & 0x7fff)
#define OP_BITNUM() ((m_ir >> 27) & 0x1f)
#define OP_ROTATE() (m_ir & 0x1f)
#define OP_ENDMASK() ((m_ir >> 5) & 0x1f)
#define OP_SRC1() (m_ir & 0x1f)
#define OP_PD() ((m_ir >> 9) & 0x3)
#define OP_P1() ((m_ir >> 5) & 0x3)
#define OP_P2() ((m_ir >> 7) & 0x3)
#define OP_ACC() ((m_ir >> 15) & 0x2) | ((m_ir >> 11) & 1)

#define ROTATE_L(x, r) ((x << r) | (x >> (32-r)))
#define ROTATE_R(x, r) ((x >> r) | (x << (32-r)))

#define CMP_OVERFLOW32(r, s, d)     ((((d) ^ (s)) & ((d) ^ (r)) & 0x80000000) ? 1 : 0)
#define CMP_OVERFLOW16(r, s, d)     ((((d) ^ (s)) & ((d) ^ (r)) & 0x8000) ? 1 : 0)
#define CMP_OVERFLOW8(r, s, d)      ((((d) ^ (s)) & ((d) ^ (r)) & 0x80) ? 1 : 0)
#define CARRY32(x)                  (((x) & (((uint64_t)1) << 32)) ? 1 : 0)
#define CARRY16(x)                  (((x) & 0x10000) ? 1 : 0)
#define CARRY8(x)                   (((x) & 0x100) ? 1 : 0)
#define SIGN32(x)                   (((x) & 0x80000000) ? 1 : 0)
#define SIGN16(x)                   (((x) & 0x8000) ? 1 : 0)
#define SIGN8(x)                    (((x) & 0x80) ? 1 : 0)

#define SIGN_EXTEND(x, r)           ((x) | (((x) & (0x80000000 >> r)) ? ((int32_t)(0x80000000) >> r) : 0))



bool tms32082_mp_device::test_condition(int condition, uint32_t value)
{
	switch (condition)
	{
		case 0x00:  return false;                   // never, byte
		case 0x01:  return (int8_t)(value) > 0;       // greater than zero, byte
		case 0x02:  return (int8_t)(value) == 0;      // equals zero, byte
		case 0x03:  return (int8_t)(value) >= 0;      // greater than or equal to zero, byte
		case 0x04:  return (int8_t)(value) < 0;       // less than zero, byte
		case 0x05:  return (int8_t)(value) != 0;      // not equal to zero, byte
		case 0x06:  return (int8_t)(value) <= 0;      // less than or equal to zero, byte
		case 0x07:  return true;                    // always, byte
		case 0x08:  return false;                   // never, word
		case 0x09:  return (int16_t)(value) > 0;      // greater than zero, word
		case 0x0a:  return (int16_t)(value) == 0;     // equals zero, word
		case 0x0b:  return (int16_t)(value) >= 0;     // greater than or equal to zero, word
		case 0x0c:  return (int16_t)(value) < 0;      // less than zero, word
		case 0x0d:  return (int16_t)(value) != 0;     // not equal to zero, word
		case 0x0e:  return (int16_t)(value) <= 0;     // less than or equal to zero, word
		case 0x0f:  return true;                    // always, word
		case 0x10:  return false;                   // never, dword
		case 0x11:  return (int32_t)(value) > 0;      // greater than zero, dword
		case 0x12:  return (int32_t)(value) == 0;     // equals zero, dword
		case 0x13:  return (int32_t)(value) >= 0;     // greater than or equal to zero, dword
		case 0x14:  return (int32_t)(value) < 0;      // less than zero, dword
		case 0x15:  return (int32_t)(value) != 0;     // not equal to zero, dword
		case 0x16:  return (int32_t)(value) <= 0;     // less than or equal to zero, dword
		case 0x17:  return true;                    // always, dword
		default:    return false;                   // reserved
	}
}

uint32_t tms32082_mp_device::calculate_cmp(uint32_t src1, uint32_t src2)
{
	uint16_t src1_16 = (uint16_t)(src1);
	uint8_t src1_8 = (uint8_t)(src1);
	uint16_t src2_16 = (uint16_t)(src2);
	uint8_t src2_8 = (uint8_t)(src2);

	uint64_t res32 = (uint64_t)src1 - (uint64_t)src2;
	int z32 = (res32 == 0) ? 1 : 0;
	int n32 = SIGN32(res32);
	int v32 = CMP_OVERFLOW32(res32, src2, src1);
	int c32 = CARRY32(res32);

	uint32_t res16 = (uint32_t)src1_16 - (uint32_t)src2_16;
	int z16 = (res16 == 0) ? 1 : 0;
	int n16 = SIGN16(res16);
	int v16 = CMP_OVERFLOW16(res16, src2_16, src1_16);
	int c16 = CARRY16(res16);

	uint16_t res8 = (uint16_t)src1_8 - (uint16_t)src2_8;
	int z8 = (res8 == 0) ? 1 : 0;
	int n8 = SIGN8(res8);
	int v8 = CMP_OVERFLOW8(res8, src2_8, src1_8);
	int c8 = CARRY8(res8);

	uint32_t flags = 0;
	// 32-bits (bits 20-29)
	flags |= ((~c32) & 1) << 29;                                // higher than or same (C)
	flags |= ((c32) & 1) << 28;                                 // lower than (~C)
	flags |= ((c32|z32) & 1) << 27;                             // lower than or same (~C|Z)
	flags |= ((~c32&~z32) & 1) << 26;                           // higher than (C&~Z)
	flags |= (((n32&v32)|(~n32&~v32)) & 1) << 25;               // greater than or equal (N&V)|(~N&~V)
	flags |= (((n32&~v32)|(~n32&v32)) & 1) << 24;               // less than (N&~V)|(~N&V)
	flags |= (((n32&~v32)|(~n32&v32)|(z32)) & 1) << 23;         // less than or equal (N&~V)|(~N&V)|Z
	flags |= (((n32&v32&~z32)|(~n32&~v32&~z32)) & 1) << 22;     // greater than (N&V&~Z)|(~N&~V&~Z)
	flags |= ((~z32) & 1) << 21;                                // not equal (~Z)
	flags |= ((z32) & 1) << 20;                                 // equal (Z)
	// 16-bits (bits 10-19)
	flags |= ((~c16) & 1) << 19;                                // higher than or same (C)
	flags |= ((c16) & 1) << 18;                                 // lower than (~C)
	flags |= ((c16|z16) & 1) << 17;                             // lower than or same (~C|Z)
	flags |= ((~c16&~z16) & 1) << 16;                           // higher than (C&~Z)
	flags |= (((n16&v16)|(~n16&~v16)) & 1) << 15;               // greater than or equal (N&V)|(~N&~V)
	flags |= (((n16&~v16)|(~n16&v16)) & 1) << 14;               // less than (N&~V)|(~N&V)
	flags |= (((n16&~v16)|(~n16&v16)|(z16)) & 1) << 13;         // less than or equal (N&~V)|(~N&V)|Z
	flags |= (((n16&v16&~z16)|(~n16&~v16&~z16)) & 1) << 12;     // greater than (N&V&~Z)|(~N&~V&~Z)
	flags |= ((~z16) & 1) << 11;                                // not equal (~Z)
	flags |= ((z16) & 1) << 10;                                 // equal (Z)
	// 8-bits (bits 0-9)
	flags |= ((~c8) & 1) << 9;                                  // higher than or same (C)
	flags |= ((c8) & 1) << 8;                                   // lower than (~C)
	flags |= ((c8|z8) & 1) << 7;                                // lower than or same (~C|Z)
	flags |= ((~c8&~z8) & 1) << 6;                              // higher than (C&~Z)
	flags |= (((n8&v8)|(~n8&~v8)) & 1) << 5;                    // greater than or equal (N&V)|(~N&~V)
	flags |= (((n8&~v8)|(~n8&v8)) & 1) << 4;                    // less than (N&~V)|(~N&V)
	flags |= (((n8&~v8)|(~n8&v8)|(z8)) & 1) << 3;               // less than or equal (N&~V)|(~N&V)|Z
	flags |= (((n8&v8&~z8)|(~n8&~v8&~z8)) & 1) << 2;            // greater than (N&V&~Z)|(~N&~V&~Z)
	flags |= ((~z8) & 1) << 1;                                  // not equal (~Z)
	flags |= ((z8) & 1) << 0;                                   // equal (Z)

	return flags;
}

void tms32082_mp_device::vector_loadstore()
{
	int rd = OP_RD();
	int vector_ls_bits = (((m_ir >> 9) & 0x3) << 1) | ((m_ir >> 6) & 1);

	switch (vector_ls_bits)
	{
		case 0x01:          // vst.s
		{
			m_program->write_dword(m_outp, m_reg[rd]);
			m_outp += 4;
			break;
		}
		case 0x03:          // vst.d
		{
			uint64_t data = m_fpair[rd >> 1];
			m_program->write_qword(m_outp, data);
			m_outp += 8;
			break;
		}
		case 0x04:          // vld0.s
		{
			m_reg[rd] = m_program->read_dword(m_in0p);
			m_in0p += 4;
			break;
		}
		case 0x05:          // vld1.s
		{
			m_reg[rd] = m_program->read_dword(m_in1p);
			m_in1p += 4;
			break;
		}
		case 0x06:          // vld0.d
		{
			m_fpair[rd >> 1] = m_program->read_qword(m_in0p);
			m_in0p += 8;
			break;
		}
		case 0x07:          // vld1.d
		{
			m_fpair[rd >> 1] = m_program->read_qword(m_in1p);
			m_in1p += 8;
			break;
		}

		default:
			fatalerror("vector_loadstore(): ls bits = %02X\n", vector_ls_bits);
	}
}

