mamedev/mame/src/devices/cpu/tms32082/mp_ops.cpp
void tms32082_mp_device::execute_short_imm()
{
	switch ((m_ir >> 15) & 0x7f)
	{
		case 0x02:          // cmnd
		{
			uint32_t data = OP_UIMM15();

			processor_command(data);
			break;
		}

		case 0x04:          // rdcr
		{
			int rd = OP_RD();
			uint32_t imm = OP_UIMM15();

			uint32_t r = read_creg(imm);

			if (rd)
				m_reg[rd] = r;
			break;
		}

		case 0x05:          // swcr
		{
			int rd = OP_RD();
			int rs = OP_RS();
			uint32_t imm = OP_UIMM15();

			uint32_t r = read_creg(imm);
			if (rd)
				m_reg[rd] = r;

			write_creg(imm, m_reg[rs]);
			break;
		}

		case 0x06:          // brcr
		{
			int cr = OP_UIMM15();

			if (cr == 0x0001)
			{
				// ignore jump to EIP because of how we emulate the pipeline
			}
			else
			{
				uint32_t data = read_creg(cr);

				m_fetchpc = data & ~3;
				m_ie = (m_ie & ~1) | (data & 1);        // global interrupt mask from creg
				// TODO: user/supervisor latch from creg
			}
			break;
		}

		case 0x08:          // shift.dz
		{
			int r = (m_ir & (1 << 10));
			int inv = (m_ir & (1 << 11));
			int rot = OP_ROTATE();
			int end = OP_ENDMASK();
			uint32_t source = m_reg[OP_RS()];
			int rd = OP_RD();

			uint32_t endmask = SHIFT_MASK[end ? end : 32];
			if (inv) endmask = ~endmask;

			uint32_t compmask = endmask;          // shiftmask == 0xffffffff

			uint32_t res;
			if (r)      // right
			{
				res = ROTATE_R(source, rot) & compmask;
			}
			else        // left
			{
				res = ROTATE_L(source, rot) & compmask;
			}

			if (rd)
				m_reg[rd] = res;
			break;
		}

		case 0x0a:          // shift.ds
		{
			int r = (m_ir & (1 << 10));
			int inv = (m_ir & (1 << 11));
			int rot = OP_ROTATE();
			int end = OP_ENDMASK();
			uint32_t source = m_reg[OP_RS()];
			int rd = OP_RD();

			uint32_t endmask = SHIFT_MASK[end ? end : 32];
			if (inv) endmask = ~endmask;

			uint32_t compmask = endmask;          // shiftmask == 0xffffffff

			uint32_t res;
			if (r)      // right
			{
				res = ROTATE_R(source, rot) & compmask;
				res = SIGN_EXTEND(res, rot);
			}
			else        // left
			{
				res = ROTATE_L(source, rot) & compmask;
				// sign extend makes no sense to left..
			}

			if (rd)
				m_reg[rd] = res;
			break;
		}

		case 0x0b:          // shift.ez
		{
			int r = (m_ir & (1 << 10));
			int inv = (m_ir & (1 << 11));
			int rot = OP_ROTATE();
			int end = OP_ENDMASK();
			uint32_t source = m_reg[OP_RS()];
			int rd = OP_RD();

			uint32_t endmask = SHIFT_MASK[end ? end : 32];
			if (inv) endmask = ~endmask;

			int shift = r ? 32-rot : rot;
			uint32_t shiftmask = SHIFT_MASK[shift ? shift : 32];
			uint32_t compmask = endmask & shiftmask;

			uint32_t res;
			if (r)      // right
			{
				res = ROTATE_R(source, rot) & compmask;
			}
			else        // left
			{
				res = ROTATE_L(source, rot) & compmask;
			}

			if (rd)
				m_reg[rd] = res;
			break;
		}

		case 0x0c:          // shift.em
		{
			int r = (m_ir & (1 << 10));
			int inv = (m_ir & (1 << 11));
			int rot = OP_ROTATE();
			int end = OP_ENDMASK();
			uint32_t source = m_reg[OP_RS()];
			int rd = OP_RD();

			uint32_t endmask = SHIFT_MASK[end ? end : 32];
			if (inv) endmask = ~endmask;

			uint32_t shiftmask = SHIFT_MASK[r ? 32-rot : rot];
			uint32_t compmask = endmask & shiftmask;

			uint32_t res;
			if (r)      // right
			{
				res = (ROTATE_R(source, rot) & compmask) | (m_reg[rd] & ~compmask);
			}
			else        // left
			{
				res = (ROTATE_L(source, rot) & compmask) | (m_reg[rd] & ~compmask);
			}

			if (rd)
				m_reg[rd] = res;
			break;
		}

		case 0x0d:          // shift.es
		{
			int r = (m_ir & (1 << 10));
			int inv = (m_ir & (1 << 11));
			int rot = OP_ROTATE();
			int end = OP_ENDMASK();
			uint32_t source = m_reg[OP_RS()];
			int rd = OP_RD();

			uint32_t endmask = SHIFT_MASK[end ? end : 32];
			if (inv) endmask = ~endmask;

			int shift = r ? 32-rot : rot;
			uint32_t shiftmask = SHIFT_MASK[shift ? shift : 32];
			uint32_t compmask = endmask & shiftmask;

			uint32_t res;
			if (r)      // right
			{
				res = ROTATE_R(source, rot) & compmask;
				res = SIGN_EXTEND(res, rot);
			}
			else        // left
			{
				res = ROTATE_L(source, rot) & compmask;
				// sign extend makes no sense to left..
			}

			if (rd)
				m_reg[rd] = res;
			break;
		}

		case 0x0e:          // shift.iz
		{
			int r = (m_ir & (1 << 10));
			int inv = (m_ir & (1 << 11));
			int rot = OP_ROTATE();
			int end = OP_ENDMASK();
			uint32_t source = m_reg[OP_RS()];
			int rd = OP_RD();

			uint32_t endmask = SHIFT_MASK[end ? end : 32];
			if (inv) endmask = ~endmask;

			uint32_t shiftmask = SHIFT_MASK[r ? 32-rot : rot];
			uint32_t compmask = endmask & ~shiftmask;

			uint32_t res;
			if (r)      // right
			{
				res = ROTATE_R(source, rot) & compmask;
			}
			else        // left
			{
				res = ROTATE_L(source, rot) & compmask;
			}

			if (rd)
				m_reg[rd] = res;
			break;
		}

		case 0x0f:          // shift.im
		{
			int r = (m_ir & (1 << 10));
			int inv = (m_ir & (1 << 11));
			int rot = OP_ROTATE();
			int end = OP_ENDMASK();
			uint32_t source = m_reg[OP_RS()];
			int rd = OP_RD();

			uint32_t endmask = SHIFT_MASK[end ? end : 32];
			if (inv) endmask = ~endmask;

			uint32_t shiftmask = SHIFT_MASK[r ? 32-rot : rot];
			uint32_t compmask = endmask & ~shiftmask;

			uint32_t res;
			if (r)      // right
			{
				res = (ROTATE_R(source, rot) & compmask) | (m_reg[rd] & ~compmask);
			}
			else        // left
			{
				res = (ROTATE_L(source, rot) & compmask) | (m_reg[rd] & ~compmask);
			}

			if (rd)
				m_reg[rd] = res;
			break;
		}

		case 0x11:          // and
		{
			int rd = OP_RD();
			int rs = OP_RS();
			uint32_t imm = OP_UIMM15();

			if (rd)
				m_reg[rd] = m_reg[rs] & imm;
			break;
		}

		case 0x12:          // and.tf
		{
			int rd = OP_RD();
			int rs = OP_RS();
			uint32_t imm = OP_UIMM15();

			if (rd)
				m_reg[rd] = ~m_reg[rs] & imm;
			break;
		}

		case 0x14:          // and.ft
		{
			int rd = OP_RD();
			int rs = OP_RS();
			uint32_t imm = OP_UIMM15();

			if (rd)
				m_reg[rd] = m_reg[rs] & ~imm;
			break;
		}

		case 0x17:          // or
		{
			int rd = OP_RD();
			int rs = OP_RS();
			uint32_t imm = OP_UIMM15();

			if (rd)
				m_reg[rd] = m_reg[rs] | imm;
			break;
		}

		case 0x1d:          // or.ft
		{
			int rd = OP_RD();
			int rs = OP_RS();
			uint32_t imm = OP_UIMM15();

			if (rd)
				m_reg[rd] = m_reg[rs] | ~imm;
			break;
		}

		case 0x24:
		case 0x20:          // ld.b
		{
			int rd = OP_RD();
			int base = OP_BASE();
			int m = m_ir & (1 << 17);
			int32_t offset = OP_SIMM15();

			uint32_t address = m_reg[base] + offset;
			uint32_t data = (uint8_t)m_program->read_byte(address);
			if (data & 0x80) data |= 0xffffff00;
			if (rd)
				m_reg[rd] = data;

			if (m && base)
				m_reg[base] = address;
			break;
		}

		case 0x25:
		case 0x21:          // ld.h
		{
			int rd = OP_RD();
			int base = OP_BASE();
			int m = m_ir & (1 << 17);
			int32_t offset = OP_SIMM15();

			uint32_t address = m_reg[base] + offset;
			uint32_t data = (uint16_t)m_program->read_word(address);
			if (data & 0x8000) data |= 0xffff0000;
			if (rd)
				m_reg[rd] = data;

			if (m && base)
				m_reg[base] = address;
			break;
		}

		case 0x26:
		case 0x22:          // ld
		{
			int rd = OP_RD();
			int base = OP_BASE();
			int m = m_ir & (1 << 17);
			int32_t offset = OP_SIMM15();

			uint32_t address = m_reg[base] + offset;
			uint32_t data = m_program->read_dword(address);
			if (rd)
				m_reg[rd] = data;

			if (m && base)
				m_reg[base] = address;
			break;
		}

